# Reshaping de Dados

In [1]:
import pandas as pd
import numpy as np

In [3]:
datas = pd.date_range('20200101', periods=6)
df = pd.DataFrame(np.random.randn(6, 4), index = datas, columns = ['var_a', 'var_b', 'var_c', 'var_d'])
df

               var_a     var_b     var_c     var_d
2020-01-01 -0.237697 -0.173656  0.102266  0.912511
2020-01-02  0.704347  1.564432 -0.790085 -0.030431
2020-01-03  0.586356 -0.488667 -0.075622  0.167264
2020-01-04 -0.184723  0.837238  0.345676 -1.297290
2020-01-05  0.591919 -1.212062  2.234690  1.278328
2020-01-06 -0.314498 -0.550187  0.987487 -1.168318

In [5]:
df.T # Matriz transposta do DataFrame

       2020-01-01  2020-01-02  2020-01-03  2020-01-04  2020-01-05  2020-01-06
var_a   -0.237697    0.704347    0.586356   -0.184723    0.591919   -0.314498
var_b   -0.173656    1.564432   -0.488667    0.837238   -1.212062   -0.550187
var_c    0.102266   -0.790085   -0.075622    0.345676    2.234690    0.987487
var_d    0.912511   -0.030431    0.167264   -1.297290    1.278328   -1.168318

In [6]:
df.shape

(6, 4)

In [7]:
df.T.shape

(4, 6)

In [8]:
df.T.values

array([[-0.23769723,  0.70434748,  0.58635582, -0.18472329,  0.59191878,
        -0.31449845],
       [-0.17365599,  1.56443215, -0.48866684,  0.83723784, -1.21206178,
        -0.55018704],
       [ 0.10226609, -0.79008482, -0.07562231,  0.34567639,  2.23468966,
         0.98748736],
       [ 0.91251051, -0.03043118,  0.16726406, -1.29728988,  1.27832752,
        -1.16831788]])

In [9]:
np.size(df.T.values)

24

In [10]:
df.T.size

24

In [11]:
v = df.T.values
v.reshape((2,12))

array([[-0.23769723,  0.70434748,  0.58635582, -0.18472329,  0.59191878,
        -0.31449845, -0.17365599,  1.56443215, -0.48866684,  0.83723784,
        -1.21206178, -0.55018704],
       [ 0.10226609, -0.79008482, -0.07562231,  0.34567639,  2.23468966,
         0.98748736,  0.91251051, -0.03043118,  0.16726406, -1.29728988,
         1.27832752, -1.16831788]])

# Pivot

In [12]:
dias = pd.date_range('20190101', periods=12)
dias

DatetimeIndex(['2019-01-01', '2019-01-02', '2019-01-03', '2019-01-04',
               '2019-01-05', '2019-01-06', '2019-01-07', '2019-01-08',
               '2019-01-09', '2019-01-10', '2019-01-11', '2019-01-12'],
              dtype='datetime64[ns]', freq='D')

In [13]:
pessoas = ['George', 'Vitor', 'Lucas']
pessoas

['George', 'Vitor', 'Lucas']

In [21]:
np.random.choice(pessoas)

np.str_('Lucas')

In [31]:
nome = []
gasto = []

for i in range(12):
    nome.append(np.random.choice(pessoas))
    gasto.append(np.round((np.random.rand() * 100), 2))

In [32]:
nome

[np.str_('Lucas'),
 np.str_('Vitor'),
 np.str_('George'),
 np.str_('Vitor'),
 np.str_('Vitor'),
 np.str_('George'),
 np.str_('George'),
 np.str_('George'),
 np.str_('George'),
 np.str_('George'),
 np.str_('Lucas'),
 np.str_('Vitor')]

In [33]:
gasto

[np.float64(46.73),
 np.float64(23.54),
 np.float64(6.33),
 np.float64(19.04),
 np.float64(36.09),
 np.float64(41.3),
 np.float64(20.79),
 np.float64(26.72),
 np.float64(59.63),
 np.float64(7.38),
 np.float64(59.72),
 np.float64(60.28)]

In [34]:
df = pd.DataFrame({
    'Dias': dias,
    "Nome": nome,
    "Gasto": gasto
})
df

         Dias    Nome  Gasto
0  2019-01-01   Lucas  46.73
1  2019-01-02   Vitor  23.54
2  2019-01-03  George   6.33
3  2019-01-04   Vitor  19.04
4  2019-01-05   Vitor  36.09
5  2019-01-06  George  41.30
6  2019-01-07  George  20.79
7  2019-01-08  George  26.72
8  2019-01-09  George  59.63
9  2019-01-10  George   7.38
10 2019-01-11   Lucas  59.72
11 2019-01-12   Vitor  60.28

In [36]:
df.pivot(index='Dias', columns='Nome', values='Gasto')

Nome        George  Lucas  Vitor
Dias
2019-01-01     NaN  46.73    NaN
2019-01-02     NaN    NaN  23.54
2019-01-03    6.33    NaN    NaN
2019-01-04     NaN    NaN  19.04
2019-01-05     NaN    NaN  36.09
2019-01-06   41.30    NaN    NaN
2019-01-07   20.79    NaN    NaN
2019-01-08   26.72    NaN    NaN
2019-01-09   59.63    NaN    NaN
2019-01-10    7.38    NaN    NaN
2019-01-11     NaN  59.72    NaN
2019-01-12     NaN    NaN  60.28

# Pivot Table

In [38]:
Carros = [7,4,3,2,8]
dias = pd.date_range('20190101', '20190101', periods=5)
vendedor= ['George', 'Vagner', 'Pedro', 'Vagner', 'George']
df = pd.DataFrame({
    'Vendas': Carros,
    'Data': dias,
    'Vendedor': vendedor
})
df

   Vendas       Data Vendedor
0       7 2019-01-01   George
1       4 2019-01-01   Vagner
2       3 2019-01-01    Pedro
3       2 2019-01-01   Vagner
4       8 2019-01-01   George

In [43]:
# a função pivot não permite index repedido
try:
    pd.pivot(df, index='Data', columns='Vendedor', values='Vendas')
except Exception as e:
    print("Error: ",e)

Error:  Index contains duplicate entries, cannot reshape

In [40]:
# por default a função pivot_table usa a média.
# Parâmetro aggfunc permite alterar a função de agregação

pd.pivot_table(df, index='Data', columns='Vendedor', values='Vendas')

Vendedor    George  Pedro  Vagner
Data
2019-01-01     7.5    3.0     3.0

# Stack e Unstack

In [2]:
df = pd.read_csv('https://cdncontribute.geeksforgeeks.org/wp-content/uploads/nba.csv')
df.head()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0

In [3]:
df.shape

(458, 9)

In [4]:
df.stack()

0    Name         Avery Bradley
     Team        Boston Celtics
     Number                 0.0
     Position                PG
     Age                   25.0
                      ...
456  Age                   26.0
     Height                 7-0
     Weight               231.0
     College             Kansas
     Salary            947276.0
Length: 4018, dtype: object

In [5]:
df.stack().shape

(4018,)

In [6]:
df.stack()[0]

Name         Avery Bradley
Team        Boston Celtics
Number                 0.0
Position                PG
Age                   25.0
Height                 6-2
Weight               180.0
College              Texas
Salary           7730337.0
dtype: object

In [7]:
df.stack()[0]['Name']

'Avery Bradley'

In [10]:
df_stacked = df.stack()
df_stacked

0    Name         Avery Bradley
     Team        Boston Celtics
     Number                 0.0
     Position                PG
     Age                   25.0
                      ...
456  Age                   26.0
     Height                 7-0
     Weight               231.0
     College             Kansas
     Salary            947276.0
Length: 4018, dtype: object

In [12]:
udf = df_stacked.unstack()

In [14]:
udf

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0
...,...,...,...,...,...,...,...,...,...
452,Trey Lyles,Utah Jazz,41.0,PF,20.0,6-10,234.0,Kentucky,2239800.0
453,Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0
454,Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,NaN,900000.0
455,Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,2900000.0
456,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0

# Melt

In [15]:
df = pd.DataFrame({
    'A': {0: 'a', 1: 'b', 2: 'c'},
    'B': {0: 1, 1: 3, 2: 5},
    'C': {0: 2, 1: 4, 2: 6}
})

df

   A  B  C
0  a  1  2
1  b  3  4
2  c  5  6

In [16]:
pd.melt(df, id_vars=['A'], value_vars=['B'])

   A variable  value
0  a        B      1
1  b        B      3
2  c        B      5

In [17]:
pd.melt(df, id_vars=['A'], value_vars=['B', 'C'])

   A variable  value
0  a        B      1
1  b        B      3
2  c        B      5
3  a        C      2
4  b        C      4
5  c        C      6

In [18]:
pd.melt(df, id_vars=['A'], value_vars=['B','C'], var_name='VAR', value_name='VAL')

   A VAR  VAL
0  a   B    1
1  b   B    3
2  c   B    5
3  a   C    2
4  b   C    4
5  c   C    6

In [19]:
data = {
    'localizacao': ['CidadeA', 'CidadeB'],
    'temperatura': ['Prevista', 'Atual'],
    'Set-2019': [30, 32],
    'Out-2019': [45, 43],
    'Nov-2019': [24, 22]
}
data

{'localizacao': ['CidadeA', 'CidadeB'],
 'temperatura': ['Prevista', 'Atual'],
 'Set-2019': [30, 32],
 'Out-2019': [45, 43],
 'Nov-2019': [24, 22]}

In [22]:
df = pd.DataFrame(data)
df

  localizacao temperatura  Set-2019  Out-2019  Nov-2019
0     CidadeA    Prevista        30        45        24
1     CidadeB       Atual        32        43        22

In [23]:
df2 = pd.melt(df, id_vars=['localizacao', 'temperatura'], var_name='date', value_name='value')
df2

  localizacao temperatura      date  value
0     CidadeA    Prevista  Set-2019     30
1     CidadeB       Atual  Set-2019     32
2     CidadeA    Prevista  Out-2019     45
3     CidadeB       Atual  Out-2019     43
4     CidadeA    Prevista  Nov-2019     24
5     CidadeB       Atual  Nov-2019     22

In [25]:
df3 = pd.melt(df, id_vars=['localizacao'], var_name='date', value_name='value')
df3

  localizacao         date     value
0     CidadeA  temperatura  Prevista
1     CidadeB  temperatura     Atual
2     CidadeA     Set-2019        30
3     CidadeB     Set-2019        32
4     CidadeA     Out-2019        45
5     CidadeB     Out-2019        43
6     CidadeA     Nov-2019        24
7     CidadeB     Nov-2019        22